# Data exploratory and Pre-Processing

Let's see the data and understand each oject feature
First off all Lets create a new dataset, for security and not change the original dataset

In [276]:
train = df_train.copy()
test = df_test.copy()

In [277]:
obj_features = train.columns[(train.dtypes == object)]

First field is Name, what can you do this, well, first is the Surname, exemples: Mr. Mrs, Miss, etc, lets take this
and create new columns with each Surname

In [278]:
train[obj_features].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

You can ca run the simple title like Mr, Mrs, Miss, because it's more mommum, then you run th value_counts()
than you can see how others that less you change, this way I got the list below "surname"
than you can create the loop to replaces the long name for only simple title name

In [279]:
surname = ['Mr.', 'Mrs', 'Miss', 'Master', 'Rev.', 'Dr', 'Col.', 'Sir.', 'Major', 'Don.', 'Capt']
for rep in surname:
    for name in train['Name'][train.Name.str.contains(rep, regex=False)]:
        if rep in ['Col.', 'Major', 'Capt']:
            train.replace(name, 'Army', inplace=True)
        elif rep in ['Sir.', 'Don.']:
            train.replace(name, 'Mr.', inplace=True)
        else:
            train.replace(name, rep, inplace=True)

i if run now the value_counts() you can see that there are a 6 values that not especified the surname
than apparently they are a miss, than i get the new list and if not in than get like miss, see below.

In [280]:
for title in train.Name:
    if title not in ['Mr.', 'Miss', 'Mrs', 'Master', 'Dr', 'Rev', 'Army']:
        train.replace(title, 'Miss', inplace=True)

In [281]:
train.Name.value_counts() # ok now you can see only six group of surname title

Mr.       519
Miss      191
Mrs       129
Master     40
Dr          7
Army        5
Name: Name, dtype: int64

Now you can see the six kind of surname title, than you can transform in numeric, because not is possible
run the model prediction with string, only numeric column.
you can do a function to transform, but there are a function called get_dummies(), see below

In [282]:
train = pd.concat([train, pd.get_dummies(train['Name'], prefix='Name')], axis=1)
# automaticaly create a new column each values in Name